OpenFoam_Shapes/Square/design_points/design_point_1/0/mag(U)
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      mag(U);
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    FrontBack
    {
        type            empty;
    }
    Cylinder
    {
        type            calculated;
        value           uniform 0;
    }
    Bottom
    {
        type            calculated;
        value           uniform 0;
    }
    Top
    {
        type            calculated;
        value           uniform 0;
    }
    Inlet
    {
        type            calculated;
        value           uniform 0.1;
    }
    Outlet
    {
        type            calculated;
        value           uniform 0;
    }
}


// ************************************************************************* //
